app/views/books/_index.html.erb

SELECT "books".* FROM "books" WHERE (title LIKE 'te%')
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 3]]
---
      <td class="p-3">
        コメント数：<%= book.book_comments.count %>