app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE (name LIKE '%mizuki%')
---
  def index
    @users = User.all